class Disease:
    def __init__(self, name, symptoms):
        self.name = name
        self.symptoms = symptoms
        self.probability = 0
        
        

# Перечень заболеваний. В списке симптомы из symptoms
disease1 = Disease(
    "ХРОНИЧЕСКАЯ СЕРДЕЧНАЯ НЕДОСТАТОЧНОСТЬ",
    [
        "отдышка","ортопноэ", "плохая переносимость физической нагрузки", "утомляемость, усталость", "отек ног"
    ]
)

disease2 = Disease(
    "АХАЛАЗИЯ ПИЩЕВОДА",
    [
        "дисфагия","боль в груди: давящая", "кашель"
    ]
)
disease3 = Disease(
    "БРОНХИАЛЬНАЯ АСТМА",
    [
        "свистящее дыхание","удушье", "боль в груди: давящая","отдышка", "кашель"
    ]
)

disease4 = Disease(
    "ВНЕБОЛЬНИЧНАЯ ПНЕВМОНИЯ",
    [
        "повышенная температура","кашель", "отделение мокроты","боль в груди: давящая", "отдышка"
    ]
)
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! изменить нижний
disease5 = Disease(
    "ВНЕБОЛЬНИЧНАЯ ПНЕВМОНИЯ",
    [
        "изжога","регургитация", "отделение мокроты","боль в груди: давящая"
    ]
)

disease6 = Disease(
    "НАДЖЕЛУДОЧКОВАЯ И ЖЕЛУДОЧКОВАЯ ЭКСТРАСИСТОЛИЯ",
    [
        "ощущение перебоев в работе сердца","отдышка", 
    ]
)

disease7 = Disease(
    "ОРВИ",
    [
        "слабость","невысокая температура", "ломота в теле","заложенность носа","боль в горле"
    ]
)

disease8 = Disease(
    "АЛЛЕРГИЧЕСКИЙ РИНИТ",
    [
        "ринорея","чихание", "заложенность носа","зуд в носу","снижение обоняния","усиление симптомов заболевания при контакте с аллергеном","слезотечение"
    ]
)
# Список всех заболеваний
all_diseases = [disease1, disease2, disease3, disease4, disease5, disease6, disease7]