list_all_symptoms =[
   'повышенная температура',
    'невысокая температура',
    'высокая температура',
    'температура: поднялась сегодня',
    'температура: поднялась несколько дней назад',
    'боль в груди: сжимающая',
    'боль в груди: давящая',
    'боль в груди: жгущая',
    'отдышка',
    'отдышка: возикла сегодня',
    'отдышка: возикла несколько дней назад',
    'плохая переносимость физической нагрузки',
    'утомляемость, усталость',
    'отек ног',
    'дисфагия',
    'кашель',
    'свистящее дыхание',
    'удушье',
    'отделение мокроты',
    'изжога',
    'регургитация',
    'ощущение перебоев в работе сердца',
    'слабость',
    'ломота в теле',
    'заложенность носа',
    'боль в горле',
    'ортопноэ',
    'ринорея',
    "чихание",
    "зуд в носу",
    "снижение обоняния",
    "усиление симптомов заболевания при контакте с аллергеном",
    "слезотечение",
    
    
    
]
# Определение симптомов
symptoms = {
    "температура": {'symptoms':
    [
        {'id':'1', 'sp':'повышенная температура', 'res':False, 'type':'minmax', 'min':37, 'max':42}, 
        {'id':'1', 'sp':'невысокая температура', 'res':False, 'type':'minmax', 'min':37, 'max':38}, 
        {'id':'1','sp':'высокая температура', 'res':False, 'type':'minmax', 'min':38, 'max':42},
    ], 'questions':
    [
        {'id':'0', "text": "Вы измеряли свою температуру?", "type":"yesno"},
        {'id':'1', "text": "Какое значение температуры у Вас было?", "type":"float"},
    ]},
    "боль в груди": {'symptoms':
    [
        {'id':'1', 'sp':'боль в груди: сжимающая', 'res':False, 'type':'case', "answer":"сжимающая"}, 
        {'id':'1','sp':'боль в груди: давящая', 'res':False, 'type':'case', "answer":"давящая"},
        {'id':'1','sp':'боль в груди: жгущая', 'res':False, 'type':'case', "answer":"жгущая"},
        {'id':'2','sp':'боль в груди: возикла сегодня', 'res':False, 'type':'minmax', 'min':0, 'max':0},
        {'id':'2','sp':'боль в груди: возикла несколько дней назад', 'res':False, 'type':'minmax', 'min':0, 'max':0},
    ], 'questions':
    [
        {'id':'0', "text": "Есть ли у Вас боль в груди?", "type":"yesno", "answer":"yes"},
        {'id':'1', "text": "Какой характер боли? сжимающая, давящая, жгущая?", "type": "case", "answer":["сжимающая", "давящая", "жгущая"]},
        # {'id':'2', "text": "Как давно возникла боль (целых дней)?", "type":"int"},
    ]},
    "отдышка": {'symptoms':
    [
        {'id':'0', 'sp':'отдышка', 'res':False, 'type':'yesno', "answer":"yes"}, 
        {'id':'1','sp':'отдышка: возикла сегодня', 'res':False, 'type':'minmax', 'min':0, 'max':0},
        {'id':'1','sp':'отдышка: возикла несколько дней назад', 'res':False, 'type':'minmax', 'min':0, 'max':0},    
    ], 'questions':
    [
        {'id':'0', "text": "Есть ли у Вас отдышка?", "type":"yesno", "answer":"yes"},
        # {'id':'1', "text": "Как давно возникла отдышка (целых дней)?", "type":"int"},
    ]},
    "плохая переносимость физической нагрузки": {'symptoms':
    [
        {'id':'0', 'sp':'плохая переносимость физической нагрузки', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Плохо ли Вы переносите физические нагрузки?", "type":"yesno", "answer":"yes"},

    ]},
    "утомляемость, усталость": {'symptoms':
    [
        {'id':'0', 'sp':'утомляемость, усталость', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдается ли у Вас утомляемость, усталость, увеличение времени восстановления после прекращения нагрузки?", "type":"yesno", "answer":"yes"},

    ]},
    "отек ног": {'symptoms':
    [
        {'id':'0', 'sp':'отек ног', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдается ли у Вас отек ног?", "type":"yesno", "answer":"yes"},

    ]},
    "дисфагия": {'symptoms':
    [
        {'id':'0', 'sp':'дисфагия', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя затруднение при прохождении пищи по пищеводу?", "type":"yesno", "answer":"yes"},

    ]},
    "кашель": {'symptoms':
    [
        {'id':'0', 'sp':'кашель', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя кашель?", "type":"yesno", "answer":"yes"},

    ]},
    "свистящее дыхание": {'symptoms':
    [
        {'id':'0', 'sp':'свистящее дыхание', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя свистящее дыхание?", "type":"yesno", "answer":"yes"},

    ]},
    "удушье": {'symptoms':
    [
        {'id':'0', 'sp':'удушье', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя удушье?", "type":"yesno", "answer":"yes"},

    ]},
    "отделение мокроты": {'symptoms':
    [
        {'id':'0', 'sp':'отделение мокроты', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя отделение мокроты?", "type":"yesno", "answer":"yes"},

    ]},
    "изжога": {'symptoms':
    [
        {'id':'0', 'sp':'изжога', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя изжогу?", "type":"yesno", "answer":"yes"},

    ]},
    "регургитация": {'symptoms':
    [
        {'id':'0', 'sp':'регургитация', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя отрыжка кислым, горьким, пищей?", "type":"yesno", "answer":"yes"},

    ]},
    "ощущение перебоев в работе сердца": {'symptoms':
    [
        {'id':'0', 'sp':'ощущение перебоев в работе сердца', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя ощущение перебоев в работе сердца, ощущение переворотов сердца?", "type":"yesno", "answer":"yes"},

    ]},
    "слабость": {'symptoms':
    [
        {'id':'0', 'sp':'слабость', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдали ли вы у себя слабость?", "type":"yesno", "answer":"yes"},

    ]},
    "ломота в теле": {'symptoms':
    [
        {'id':'1', 'sp':'ломота в теле', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'1', "text": "Наблюдали ли вы у себя ломоту в теле?", "type":"yesno", "answer":"yes"},

    ]},
    "заложенность носа": {'symptoms':
    [
        {'id':'1', 'sp':'заложенность носа', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'1', "text": "Наблюдаете ли вы у себя заложенность носа?", "type":"yesno", "answer":"yes"},

    ]},    
    "боль в горле": {'symptoms':
    [
        {'id':'1', 'sp':'боль в горле', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'1', "text": "Наблюдаете ли вы у себя боль в горле?", "type":"yesno", "answer":"yes"},

    ]},    
    "ортопноэ": {'symptoms':
    [
        {'id':'1', 'sp':'ортопноэ', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'1', "text": "Наблюдаете ли вы у себя дышку, возникающую в лежачем положении, в результате чего приходится спать, приподнявшись в кровати или сидя на стуле?", "type":"yesno", "answer":"yes"},

    ]},  
    
        "ринорея": {'symptoms':
    [
        {'id':'0', 'sp':'ринорея', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдается ли у Вас водянистые выделения из носа (сопли)?", "type":"yesno", "answer":"yes"},

    ]}, 
        
         "чихание": {'symptoms':
    [
        {'id':'0', 'sp':'чихание', 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдаете ли вы у себя приступообразное чихание?", "type":"yesno", "answer":"yes"},

    ]},       
        
    "зуд в носу": {'symptoms':
    [
        {'id':'0', 'sp':"зуд в носу", 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдаете ли вы у себя зуд, реже – чувство жжения в носу?", "type":"yesno", "answer":"yes"},

    ]},       
        
    "снижение обоняния": {'symptoms':
    [
        {'id':'0', 'sp':"снижение обоняния", 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдаете ли вы у себя снижение обоняния?", "type":"yesno", "answer":"yes"},

    ]},       
        
    "усиление симптомов заболевания при контакте с аллергеном": {'symptoms':
    [
        {'id':'0', 'sp':"усиление симптомов заболевания при контакте с аллергеном", 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдаете ли вы у себя усиление симптомов заболевания при контакте с аллергеном?", "type":"yesno", "answer":"yes"},

    ]},       
        
    "слезотечение": {'symptoms':
    [
        {'id':'0', 'sp':"слезотечение", 'res':False, 'type':'yesno', "answer":"yes"},   
    ], 'questions':
    [
        {'id':'0', "text": "Наблюдается ли у Вас слезотечение?", "type":"yesno", "answer":"yes"},

    ]},       
                                 
}
