      
        

# Перечень заболеваний. В списке симптомы из symptoms


disease1 = {'name': "ХРОНИЧЕСКАЯ СЕРДЕЧНАЯ НЕДОСТАТОЧНОСТЬ", 'symptoms':
    [
        "отдышка","ортопноэ", "плохая переносимость физической нагрузки", "утомляемость, усталость", "отек ног", 
    ]
    ['rec': "Для облегчения симптомов возможной хронической сердечной недостаточности следует ограничить соль и жидкость, отдохнуть в положении полусидя, расслабиться и срочно обратиться к врачу."]
}

disease2 = {'name': "АХАЛАЗИЯ ПИЩЕВОДА", 'symptoms':
    [
        "дисфагия","боль в груди: давящая", "кашель",
    ]
    ['rec':"При симптомах ахалазии пищевода ешьте медленно, употребляйте мягкую пищу, пейте тёплую воду маленькими глотками, оставайтесь вертикально после еды и спите с приподнятым изголовьем. стоит обратиться к врачу."]
}
disease3 = {'name': "БРОНХИАЛЬНАЯ АСТМА", 'symptoms':
    [
        "свистящее дыхание","удушье", "боль в груди: давящая","отдышка", "кашель"
    ]
    ['rec':"При приступе бронхиальной астмы примите сидячее положение с опорой руками на стол или колени, дышите спокойно и глубоко, постарайтесь успокоиться, обеспечьте доступ свежего воздуха, исключите контакт с аллергенами и раздражителями, незамедлительно обратитесь за медицинской помощью."]

}

disease4 = {'name': "ВНЕБОЛЬНИЧНАЯ ПНЕВМОНИЯ", 'symptoms':
    [
        "повышенная температура","кашель", "отделение мокроты","боль в груди: давящая", "отдышка"
    ]
    ['rec':""]
}
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! изменить нижний
disease5 = {'name': "АРТЕРИАЛЬНАЯ ГИПЕРТЕНЗИЯ", 'symptoms':
    [
        "Высокое давление","Головная боль", "Шум или звон в ушах","Тошнота"
    ]
}

disease6 = {'name': "ИНСУЛЬТ", 'symptoms':
    [
        "паралич одной стороны тела","Нарушение речи","Резкая головная боль без видимой причины","потеря ориентации в пространстве","Резкая головная боль"
    ]
}

disease7 = {'name': "ОРВИ", 'symptoms':
    [
        "слабость","невысокая температура", "ломота в теле","заложенность носа","боль в горле"
    ]
}

disease8 = {'name': "АЛЛЕРГИЧЕСКИЙ РИНИТ", 'symptoms':
    [
        "ринорея","чихание", "заложенность носа","зуд в носу","снижение обоняния","усиление симптомов заболевания при контакте с аллергеном","слезотечение"
    ]
}
# Список всех заболеваний
all_diseases = [disease1, disease2, disease3, disease4, disease5, disease6, disease7]

