      
        

# Перечень заболеваний. В списке симптомы из symptoms


disease1 = {'name': "ХРОНИЧЕСКАЯ СЕРДЕЧНАЯ НЕДОСТАТОЧНОСТЬ", 'symptoms':
    [
        "отдышка","ортопноэ", "плохая переносимость физической нагрузки", "утомляемость, усталость", "отек ног", 
        'rec': "Для облегчения симптомов возможной хронической сердечной недостаточности следует ограничить соль и жидкость, отдохнуть в положении полусидя, расслабиться и срочно обратиться к врачу."
    ]
}

disease2 = {'name': "АХАЛАЗИЯ ПИЩЕВОДА", 'symptoms':
    [
        "дисфагия","боль в груди: давящая", "кашель"
    ]
}
disease3 = {'name': "БРОНХИАЛЬНАЯ АСТМА", 'symptoms':
    [
        "свистящее дыхание","удушье", "боль в груди: давящая","отдышка", "кашель"
    ]
}

disease4 = {'name': "ВНЕБОЛЬНИЧНАЯ ПНЕВМОНИЯ", 'symptoms':
    [
        "повышенная температура","кашель", "отделение мокроты","боль в груди: давящая", "отдышка"
    ]
}
#!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! изменить нижний
disease5 = {'name': "ВНЕБОЛЬНИЧНАЯ ПНЕВМОНИЯ", 'symptoms':
    [
        "изжога","регургитация", "отделение мокроты","боль в груди: давящая"
    ]
}

disease6 = {'name': "НАДЖЕЛУДОЧКОВАЯ И ЖЕЛУДОЧКОВАЯ ЭКСТРАСИСТОЛИЯ", 'symptoms':
    [
        "ощущение перебоев в работе сердца","отдышка", 
    ]
}

disease7 = {'name': "ОРВИ", 'symptoms':
    [
        "слабость","невысокая температура", "ломота в теле","заложенность носа","боль в горле"
    ]
}

disease8 = {'name': "АЛЛЕРГИЧЕСКИЙ РИНИТ", 'symptoms':
    [
        "ринорея","чихание", "заложенность носа","зуд в носу","снижение обоняния","усиление симптомов заболевания при контакте с аллергеном","слезотечение"
    ]
}
# Список всех заболеваний
all_diseases = [disease1, disease2, disease3, disease4, disease5, disease6, disease7]

